app/helpers/sessions_helper.rb

	def current_user
		if session[:user_id]
			@current_user ||= User.find_by(id: session[:user_id])
		else cookies.encrypted[:user_id]
			user=User.find_by(id: cookies.encrypted[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]