app/controllers/sessions_controller.rb

  def create
  	user_email = params[:session][:email]
  	user = User.find_by(email: user_email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "saumya@gmail.com"], ["LIMIT", 1]]