app/controllers/users_controller.rb

  def show
    user_id = params[:id]
    @user=User.find(user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]